test/fixtures/files/stripe/checkout.session.completed.json

{
  "object": {
    "id": "cs_test_a1UejXx8ebIdTzFolicVypUAZpOBVkoQKDbaarXoPlPVtj8p0zujPEEhjT",
    "object": "checkout.session",
    "after_expiration": null,
    "allow_promotion_codes": null,
    "amount_subtotal": 1900,
    "amount_total": 1900,
    "automatic_tax": {
      "enabled": false,
      "status": null
    },
    "billing_address_collection": null,
    "cancel_url": "http://localhost:3000/?session_id={CHECKOUT_SESSION_ID}",
    "client_reference_id": null,
    "consent": null,
    "consent_collection": null,
    "currency": "usd",
    "customer": "cus_M5wW9RPFk9xNZ5",
    "customer_creation": null,
    "customer_details": {
      "address": {
        "city": null,
        "country": "US",
        "line1": null,
        "line2": null,
        "postal_code": "42424",
        "state": null
      },
      "email": "chris@gorails.com",
      "name": "Chris Oliver",
      "phone": null,
      "tax_exempt": "none",
      "tax_ids": [
      ]
    },
    "customer_email": null,
    "expires_at": 1658439696,
    "livemode": false,
    "locale": null,
    "metadata": {
    },
    "mode": "subscription",
    "payment_intent": null,
    "payment_link": null,
    "payment_method_options": null,
    "payment_method_types": [
      "card",
      "us_bank_account"
    ],
    "payment_status": "paid",
    "phone_number_collection": {
      "enabled": false
    },
    "recovered_from": null,
    "setup_intent": null,
    "shipping": null,
    "shipping_address_collection": null,
    "shipping_options": [
    ],
    "shipping_rate": null,
    "status": "complete",
    "submit_type": null,
    "subscription": "sub_1LNkeSKXBGcbgpbZ7jMqOPSi",
    "success_url": "http://localhost:3000/?session_id={CHECKOUT_SESSION_ID}",
    "total_details": {
      "amount_discount": 0,
      "amount_shipping": 0,
      "amount_tax": 0
    },
    "url": null
  }
}
